course/19s-cx4240.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-01-27 Mon 22:42 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>CX4240: Introduction to Computational Data Analysis</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Chao" />
<link rel="stylesheet" type="text/css" href="../main.css" />
</head>
<body>
<div id="content">
<h1 class="title">CX4240: Introduction to Computational Data Analysis</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org00d81da">Logistics</a></li>
<li><a href="#orgfa74f21">Course Content</a></li>
<li><a href="#org2229bb0">Schedule</a></li>
<li><a href="#org284ca4f">Grading</a></li>
<li><a href="#orge2a391b">Resources</a></li>
</ul>
</div>
</div>

<div id="outline-container-org00d81da" class="outline-2">
<h2 id="org00d81da">Logistics</h2>
<div class="outline-text-2" id="text-org00d81da">
<ul class="org-ul">
<li><b>Lecture time</b>: Mons and Weds, 4:30pm-5:45pm</li>
<li><b>Location</b>: Klaus 1447</li>
<li><b>Instructors</b>: M. Mahdi Roozbahani and <a href="http://chaozhang.org">Chao Zhang</a></li>
<li><b>Teaching Assistant</b>: Hanjun Dai (hanjundai@gatech.edu) and Wendi Ren (wren44@gatech.edu)</li>
<li><b>Office Hours</b>:
<ul class="org-ul">
<li>Instructor: Weds 3:30-4:20pm</li>
<li>TA Office Hour I: Mons 3:30-4:20pm</li>
<li>TA Office Hour II: Fris 10:30-11:20am</li>
</ul></li>
<li><b>Piazza</b>: <a href="https://piazza.com/class/jqeo3f7s5vc426">https://piazza.com/class/jqeo3f7s5vc426</a>
<ul class="org-ul">
<li><b>Piazza</b> will be the main place for course discussions and announcements. If you have questions, please <b>ask it on Piazza first</b> because 1) other students may have the same question; 2) you will get help faster compared to sending emails.</li>
<li>If it's something you do not like to discuss publicly on Piazza, send an email with <b>CX4240</b> in the subject.</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-orgfa74f21" class="outline-2">
<h2 id="orgfa74f21">Course Content</h2>
<div class="outline-text-2" id="text-orgfa74f21">
<p>
This course introduces techniques for computational data analysis, with an
emphasis on <b>machine learning algorithms and their applications to real-world
data</b>. We will investigate the following question: how to extract useful
knowledge from data computationally for decision making and task support? We
will focus on on machine learning methods for computational data analysis,
which are organized into three parts:
</p>

<ol class="org-ol">
<li><b><b>Basic math for data science and machine learning</b></b>
<ul class="org-ul">
<li>Linear algebra</li>
<li>Probability and statistics</li>
<li>Information theory</li>
</ul></li>

<li><b><b>Unsupervised machine learning for data exploration</b></b>
<ul class="org-ul">
<li>Clustering analysis</li>
<li>Dimension reduction</li>
<li>Kernel density estimation</li>
</ul></li>

<li><b><b>Supervised learning for predictive data analysis</b></b>
<ul class="org-ul">
<li>Tree-based models</li>
<li>Linear classification and regression</li>
<li>Neural networks</li>
</ul></li>
</ol>

<p>
Prerequisites for this course include 1) basic knowledge of probability,
statistics, and linear algebra; 2) basic programming experience, preferably in
Python.
</p>
</div>
</div>



<div id="outline-container-org2229bb0" class="outline-2">
<h2 id="org2229bb0">Schedule</h2>
<div class="outline-text-2" id="text-org2229bb0">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Date</th>
<th scope="col" class="org-left">Topic</th>
<th scope="col" class="org-left">Assignment</th>
<th scope="col" class="org-left">Due</th>
<th scope="col" class="org-left">Readings</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">1/7/19</td>
<td class="org-left">Course Overview</td>
<td class="org-left">Piazza Signup</td>
<td class="org-left">&#xa0;</td>
<td class="org-left"><a href="https://policylibrary.gatech.edu/student-affairs/academic-honor-code">GT Honor Code</a></td>
</tr>

<tr>
<td class="org-left">1/9/19</td>
<td class="org-left">Math Basics: Linear Algebra</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left"><a href="http://cs229.stanford.edu/section/cs229-linalg.pdf">Linear Algebra Review by Zico Kolter</a></td>
</tr>

<tr>
<td class="org-left">1/14/19</td>
<td class="org-left">Math Basics: Probability and Statistics</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left"><a href="http://www.cs.cmu.edu/~./awm/tutorials/prob.html">Probability Theory Review by Andrew Moore</a></td>
</tr>

<tr>
<td class="org-left">1/16/19</td>
<td class="org-left">Math Basics: Information Theory</td>
<td class="org-left">AS1 Out</td>
<td class="org-left">&#xa0;</td>
<td class="org-left"><a href="http://colah.github.io/posts/2015-09-Visual-Information/">Visual Information Theory by Chris Olah</a></td>
</tr>

<tr>
<td class="org-left">1/21/19</td>
<td class="org-left"><b><b>No Class</b></b> (Martin Luther King Day)</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">1/23/19</td>
<td class="org-left">Data Analysis Toolbox</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left"><a href="http://cs231n.github.io/python-numpy-tutorial/">NumPy Tutorial</a>; <a href="https://www.labri.fr/perso/nrougier/teaching/matplotlib/">Matplotlib Tutorial</a></td>
</tr>

<tr>
<td class="org-left">1/28/19</td>
<td class="org-left">Clustering Analysis and K-Means</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">AS1 Due</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">1/30/19</td>
<td class="org-left">Hierarchical Clustering</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">2/4/19</td>
<td class="org-left">Density-Based Clustering</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">2/6/19</td>
<td class="org-left">Gaussian Mixture Model</td>
<td class="org-left">AS2 Out</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">2/11/19</td>
<td class="org-left">Evaluation of Clustering Algorithms</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">2/13/19</td>
<td class="org-left">Density Estimation</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">2/18/19</td>
<td class="org-left">Dimension Reduction</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">2/20/19</td>
<td class="org-left">Midterm Review</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">AS2 Due</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">2/25/19</td>
<td class="org-left"><b><b>Midterm Exam</b></b></td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">2/27/19</td>
<td class="org-left">Linear Regression</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">3/4/19</td>
<td class="org-left">Linear Regression</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">3/6/19</td>
<td class="org-left">Naïve Bayes and Logistic Regression</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">3/11/19</td>
<td class="org-left">Support Vector Machine</td>
<td class="org-left">AS3 Out</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">3/13/19</td>
<td class="org-left">Support Vector Machine</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">3/18/19</td>
<td class="org-left"><b><b>No Class</b></b> (Spring Break)</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">3/20/19</td>
<td class="org-left"><b><b>No Class</b></b> (Spring Break)</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">3/25/19</td>
<td class="org-left">Neural Networks</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">3/27/19</td>
<td class="org-left">Neural Networks</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">AS3 Due</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">4/1/19</td>
<td class="org-left">Decision Tree and Random Forest</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">4/3/19</td>
<td class="org-left">Decision Tree and Random Forest</td>
<td class="org-left">AS4 Out</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">4/8/19</td>
<td class="org-left">Model Selection</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">4/10/19</td>
<td class="org-left"><b><b>No Class</b></b> (Project Preparation)</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">4/15/19</td>
<td class="org-left">Project Presentation</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">4/17/19</td>
<td class="org-left">Project Presentation</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">AS4 Due</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">4/22/19</td>
<td class="org-left">Course Review</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">4/24/19</td>
<td class="org-left">Reading Day</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Report Due</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>


<div id="outline-container-org284ca4f" class="outline-2">
<h2 id="org284ca4f">Grading</h2>
<div class="outline-text-2" id="text-org284ca4f">
<ul class="org-ul">
<li><b>Assignments (50%)</b>
<ul class="org-ul">
<li>There will be four assignments. Each one is designed for testing your understanding of the taught algorithms. It could be either programming or written analysis.</li>
<li>You will need to hand in the assignments at the beginning of the class on the due date.</li>
<li>All assignments follow the "no-late" policy. Assignments received after the due time will receive zero credit.</li>
<li>All students are expected to follow the Georgia Tech Academic Honor Code.</li>
</ul></li>

<li><b>Project (20%)</b>
<ul class="org-ul">
<li>You are expected to complete a project on computational data analysis with real-life data. Your project needs to be clear about 1) the data you are using; 2) the problem you are attempting to solve; 3) the method you are using; 4) the results and conclusion you attain.</li>
<li>You will need to turn in a project report and also give an in-class presentation for your project. The project report and the presentation will each count for 10% of your final grade.</li>
<li>Each project needs to be completed in a team of 2-4 people. Team members need to clearly claim their contributions in the project report.</li>
</ul></li>

<li><b>Class participation (5%)</b>
<ul class="org-ul">
<li>Your class participation score will be graded based on attendance and in-class quizzes.</li>
<li>Participation in class discussions (including asking relevant questions in class, volunteering to answer questions on Piazza) will be considered when determining your final grade. It will be especially useful when you are right on the edge of two letter grades.</li>
</ul></li>

<li><b>Midterm Exam (10%)</b>
<ul class="org-ul">
<li>The midterm exam will take place on Feb 25th in lieu of the regular class.</li>
<li>The midterm exam will be a written and open-book exam, but Internet usage will not be allowed.</li>
<li>There will be no make-up exams. You will get zero credit for your missed midterm exam.</li>
</ul></li>

<li><b>Final Exam (15%)</b>
<ul class="org-ul">
<li>The final exam will be at whatever time is scheduled for this class.</li>
<li>The final exam will be a written and open-book exam, but no Internet usage will be allowed.</li>
<li>Again, there will be no make-up exams. You will get zero credit for your missed final exam.</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-orge2a391b" class="outline-2">
<h2 id="orge2a391b">Resources</h2>
<div class="outline-text-2" id="text-orge2a391b">
<ul class="org-ul">
<li><a href="http://www.cs.cmu.edu/~tom/mlbook.html">Machine learning</a>, by Tom Mitchell</li>
<li><a href="https://www.springer.com/us/book/9780387310732">Pattern recognition and machine learning</a>, by Christopher Bishop</li>
<li><a href="https://www.elsevier.com/books/data-mining-concepts-and-techniques/han/978-0-12-381479-1">Data Mining: Concepts and Techniques</a>, by Jiawei Han, Micheline Kamber, and Jian Pei</li>
<li><a href="https://web.stanford.edu/~hastie/ElemStatLearn/">The Elements of Statistical Learning</a>, by Trevor Hastie, Robert Tibshirani, and Jerome Friedman</li>
<li><a href="http://www.deeplearningbook.org/">Deep Learning</a>, by Ian Goodfellow, Yoshua Bengio, and Aaron Courville</li>
<li><a href="https://d2l.ai/">Dive into Deep Learning</a>, by Aston Zhang, Zack C. Lipton, Mu Li, and Alex Smola</li>
</ul>

<p>
Other resources, such as machine learning toolboxes and datasets, will be provided throughout the course.
</p>
</div>
</div>
</div>
</body>
</html>
